app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `password`, `phone`, `email`, `address`, `created_at`, `updated_at`) VALUES ('saideepak', 'HelloWorld!;', 911, 'saideepak09@gmail.com', '201 South 4th Street', '2015-11-02 07:42:36', '2015-11-02 07:42:36')
---
  def create_user

    puts " "
    puts "***********************************************"
    puts " "
    puts params[:users][:username]
    puts params[:users][:password]
    puts params[:users][:phone]
    puts params[:users][:email]
    puts params[:users][:address]
    puts " "
    puts "***********************************************"
    puts " "
    session[:user_id] = params[:users][:username]
    cookies[:user_id] = session[:user_id]
    puts session[:user_id]
    user =  User.new(username: params[:users][:username], password: params[:users][:password], phone: params[:users][:phone], email: params[:users][:email], address: params[:users][:address])
    user.save